{
  "rice": {
    "description": "Rice is a staple food and one of the most important cereal crops consumed worldwide."
  },
  "maize": {
    "description": "Maize, also known as corn, is a cereal grain first domesticated by indigenous peoples in southern Mexico."
  },
  "chickpea": {
    "description": "Chickpea, also known as garbanzo bean, is a legume with edible seeds and is a rich source of protein."
  },
  "kidneybeans": {
    "description": "Kidney beans are a variety of common bean and are named for their kidney-like shape."
  },
  "pigeonpeas": {
    "description": "Pigeon peas are a tropical legume grown for food, fodder, and fuel."
  },
  "mothbeans": {
    "description": "Moth beans are a drought-resistant legume primarily grown in arid and semi-arid regions."
  },
  "mungbean": {
    "description": "Mung beans are small green legumes widely cultivated in Asia and used in various culinary dishes."
  },
  "blackgram": {
    "description": "Black gram is a type of pulse cultivated in the Indian subcontinent, known for its rich protein content."
  },
  "lentil": {
    "description": "Lentils are edible legumes that come in various colors and are a good source of protein and essential nutrients."
  },
  "pomegranate": {
    "description": "Pomegranate is a fruit with a tough outer rind and juicy, seed-filled interior, known for its health benefits."
  },
  "banana": {
    "description": "Banana is a popular tropical fruit with a sweet taste and is a good source of vitamins and minerals."
  },
  "mango": {
    "description": "Mango is a tropical fruit known for its sweet and juicy flesh, commonly consumed fresh or in various culinary dishes."
  },
  "grapes": {
    "description": "Grapes are berries that come in various colors and are used for making wine, juices, and dried fruits."
  },
  "watermelon": {
    "description": "Watermelon is a refreshing and hydrating fruit with a high water content, commonly enjoyed in hot weather."
  },
  "muskmelon": {
    "description": "Muskmelon, also known as cantaloupe, is a sweet and aromatic melon with orange flesh and a netted rind."
  },
  "apple": {
    "description": "Apple is a widely cultivated fruit with a crisp texture and sweet or tart flavor, available in various varieties."
  },
  "orange": {
    "description": "Orange is a citrus fruit known for its juicy and tangy flavor, rich in vitamin C and other nutrients."
  },
  "papaya": {
    "description": "Papaya is a tropical fruit with orange flesh and black seeds, known for its digestive enzymes and health benefits."
  },
  "coconut": {
    "description": "Coconut is a versatile fruit with a hard shell, fibrous husk, and edible white flesh, often used in various culinary applications."
  },
  "cotton": {
    "description": "Cotton is a soft, fluffy fiber that grows in the bolls of the cotton plant and is commonly used to make textiles."
  },
  "jute": {
    "description": "Jute is a long, soft, and shiny vegetable fiber that can be spun into coarse, strong threads and is used for making burlap, hessian, and rope."
  },
  "coffee": {
    "description": "Coffee is a brewed beverage made from roasted coffee beans, and it is one of the most popular drinks worldwide."
  }
}
